# 只列出重点关注的列
# data_columns 可查询的数据列
CNINFO_COLS = {
    '1': {
        'data_columns': ['股票代码'],
    },
    '2.1': {
        'data_columns': ['股票代码', '变动日期', '直接持有人名称'],
    },
    '2.2': {
        'data_columns': ['股票代码', '变动日期', '变动原因'],
    },
    '2.3': {
        'data_columns': ['股票代码', '公告日期', '变动人'],
    },
    '2.4': {
        'data_columns': ['股票代码', '增减持截止日', '股东名称'],
    },
    '2.5': {
        'data_columns': ['股票代码', '截止日期'],
    },
    '3': {
        'data_columns': ['股票代码', '发布日期', '研究员名称'],
        'min_itemsize': {
            '研究机构简称': 100,
            '研究员名称': 100,
            '投资评级（经调整）':100,
            '是否首次评级':100,
            '评级变化':100,
            '前一次投资评级':100,
        },
    },
    '4.1': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '5': {
        'data_columns': ['股票代码', '分红年度'],
    },
    '6.1': {
        'data_columns': ['股票代码', '公告日期'],
    },
    '6.2': {
        'data_columns': ['股票代码', '公告日期'],
    },
    '6.3': {
        'data_columns': ['股票代码', '公告日期'],
    },
    '6.4': {
        'data_columns': ['股票代码', '公告日期'],
    },
    '6.5': {
        'data_columns': ['股票代码'],
    },
    '7.1.1': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.1.2': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.1.3': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.2.1': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.2.2': {
        'data_columns': ['股票代码', '报告期'],
    },
    '7.3.1': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.3.2': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.3.3': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.4.1': {
        'data_columns': ['股票代码', '报告年度'],
    },
    '7.4.2': {
        'data_columns': ['股票代码', '报告年度'],
    },
}